In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
data = Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [3]:
# dropna()删除缺失值
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# 去除DataFrame中的缺失值
df = DataFrame([
    [1,6.5,3.],
    [1,NA,NA],
    [NA,NA,NA],
    [NA,6.5,3.]
])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
df.dropna() # 删除所有包含NA的行

     0    1    2
0  1.0  6.5  3.0

In [10]:
df.dropna(how="all")# 只删除一行数据中全为Na的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df1 = DataFrame([
    [NA,6.5,3.],
    [NA,NA,NA],
    [NA,NA,NA],
    [NA,6.5,3.]
])
df1
df1.dropna(axis=1,how="all")

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  6.5  3.0

In [14]:
df2 = DataFrame(np.random.randn(7,3))
df2

          0         1         2
0  1.984231 -1.321724 -0.364422
1  0.548479 -0.579838  0.470549
2  2.341079  0.929302 -0.997328
3  1.340514 -0.065629 -0.088724
4 -1.015690  0.761684  1.333345
5  0.060294  0.142761 -0.092652
6 -0.202949  0.081082  1.013149

In [15]:
series1 = Series([1,2,3,NA,5,NA,7])
series2 = Series([NA,2,NA,4,5,6,NA])
df2[0] = series1
df2[2] = series2

In [16]:
# 把第0列NA值替换为999;第2列NA值替换为888；不存在的第3列没有理睬
# 调用fillna()方法，传入一个字典，实现不同列的NA值替换不同的值
df2.fillna({0:999,2:888,3:-1})

       0         1      2
0    1.0 -1.321724  888.0
1    2.0 -0.579838    2.0
2    3.0  0.929302  888.0
3  999.0 -0.065629    4.0
4    5.0  0.761684    5.0
5  999.0  0.142761    6.0
6    7.0  0.081082  888.0

In [20]:
df.fillna(0,inplace=True) # inplace修改自己本身

     0         1    2
0  1.0 -1.321724  NaN
1  2.0 -0.579838  2.0
2  3.0  0.929302  NaN
3  NaN -0.065629  4.0
4  5.0  0.761684  5.0
5  NaN  0.142761  6.0
6  7.0  0.081082  NaN